[Oreans]

&New = Novo
&Open... = Abrir
&Save = Salvar
Save &As... = Salvar Como...
&Protect = Proteger
&Help = Ajuda
About... = Sobre...
Demo Version = Versão de Demonstração
Save = Salvar

Options = Opções
Application Information = Informação da Aplicação
Protection Options = Opções de Proteção
Code Replace = Substituir Codigo
Virtual Machine = Maquina Virtual
Customized Dialogs = Dialog Personalizado
Advanced Options = Opções Avançadas
XBundler = XBundler
Help = Ajuda
Registration = Registrar
Trial Settings = Configurações de Teste
Hardware Lock = Travar HardWare
Password Protection = Proteção de Senha
Soft&ware = SoftWare
&Customers = Compradores
&License Manager = Gerenciador de Licença
&Managers = Gerentes
&Project = Projeto
Tools = Ferramentas
H&elp = Ajuda
&Contents = Conteudo
&About = Sobre
Export Generators = Gerador de Exportação
&Software = SoftWare
&License = Licença
Password = Senha
Trial Extension = Extensão de Teste
&Exit = Sair
P&rotect = Proteger
Open Project = Abrir Projeto
New Project = Novo Projeto
Save Project = Salvar Projeto
Save Project As... = Salvar Projeto como...
Protect File = Proteger Arquivo
Dupli&cate = Duplicar
(Double click to select) = (Click duplo para selecionar)


Application = Aplicação
Version = Versão
Input Filename = Arquivo de entrada 
Output Filename = Arquivo de saida
File Size = Tamanho do Arquivo
File Information = Informações do Arquivo
Get from version info = Extrair da Informação de Versão
File not found = Arquivo não encontrado
Refresh = Atualizar
Same as input = Igual a Entrada

Advanced Anti-Debugger = Anti_Debugger Avançado
Enable Protection = Habilitar Proteção
Advanced API-Wrapping = API-Wrapping Avançado
Anti Dumpers = Anti Descarga
Entry Point Obfuscation = Ponto de Entrada da Ofuscação
Anti-Patching = Anti-Correção
None = Nenhum
File Patching = Correção do Arquivo
Compression = Compressão 
Resources = Recursos
Monitor Blockers = Bloqueio dos Monitoramentos
Files Monitors = Monitorar Arquivos
Registry Monitors = Monitorar Registros
Delphi/BCB Form Protection = Proteção de Form Delphi/BCD
Memory Guard = Proteção da Memória
Resources Encryption = Criptação dos Recursos
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = Compatibilidade
When Debugger Found = Quando o Debugger encontrar
Enable Encryption = Habilitar criptação
Display Message = Mostrar Mensagem
Exit Silently = Sair Silenciosamente
Crash Application = Aplicação Defeituosa
Metamorph Security = Segurança Metamorfica
Ring-0 Protection = Proteção Ring-0
(not available in DEMO) = (Não disponivel no Demo)

Import = Importar
Export = Exportar
Reset Messages = Reiniciar Mensagens

Global Caption = Subtitulo Global
Debugger found = Debugger Encontrado
Monitor software found = Monitor de Sofware encontrado
Cracking tool found = Ferramenta de danificação encontrada
File corrupted = Arquivo Corrompido
(Not displayed in this version) = (Não é mostrado nessa versão)
Internal exception occured =  (Ocorreu uma Exceção interna)
Virtual Machine Detected = (Maquina Virtual Detectada)


Enable CodeReplace Technology = Habilitar tecnologia de Substituição de Codigo
Functions to remove using the CodeReplace Technology: = Funções a remover usando a tecnologia de Substituição de Código:
Assembly code inside function: = Código do conjunto dentro da função:
Force simulation before protection = Forçar simulação antes da proteção
Run with parameters = Rodar com parametros
Start Simulation = Iniciar Simulação

Virtual API-Wrapper = API-Wrapper Virtual
Imported DLLs: = DLLs Importadas:
Functions to Virtualize: = Função para Virtualizar:
API Virtualization Level: = Level de Virtualização da API:
Processor Specifications = Especificações do Processador
Processor Type: = Tipo do Processador:
Multiprocessor: = MultiProcessador:
Opcode Type: = Tipo do Codigo de Operação:
Dynamic Opcode: = Codigo de Operação Dinamico:
VM Complexity: = Complexidade da MV:
VM size (aprox): = Tamanho da MV (Aprox):
Execution Speed: = Velocidade de Execução:
Entry Point Virtualization = Ponto de Entrada da Virtualização
Multi Branch Technology = Tecnologia Multi Filiais

Mutable CISC processor = Processador CISC Mutavel
Mutable RISC-64 processor = Processador RISC-64 Mutavel
Mutable RISC-128 processor = Processador RISC-128 Mutavel
Mutable CISC-2 processor = Processador CISC-2 Mutavel

Static opcodes = Codigo de Operação estatico
Metamorphic - Level 1 = Metamorfico - Nivel 1
Metamorphic - Level 2 = Metamorfico - Nivel 2
Metamorphic - Level 3 = Metamorfico - Nivel 3

Disabled = Disabilitado
20% Dynamic = 20% Dinamico
40% Dynamic = 40% Dinamico
60% Dynamic = 60% Dinamico
80% Dynamic = 80% Dinamico

Enable XBundler = Habilitar XBundler
Make files visible to OpenDialog = Deixar arquivo visivel para o OpenDialog
Allow bundling from any directory = Permitir empacotamento de qualquer diretorio
AVI files support = Suporte a Arquivos AVI
Deleted extracted on exit = 
Files to bundle: (drag files here) = Arquivos para empacotar (Arraste aqui os arquivos)
XBundler Options = Opções do XBundler
Add File = Adicionar Arquivos
Delete File = Excluir Arquivos

Filename = Nome do Arquivo
Write to disk? = Escrever no disco?
Extraction Path (if written to disk) = Extração de caminho (Se escrito no disco)


Encrypt Application = Encriptar Aplicação
Protect as DLL Plugin = Proteger como DLL Plugin
Protect DLL plugin = Proteger DLL Plugin
Last Section Name = Nome da ultima seção
.NET assemblies = .net assemblies
Active Context = Ativar Contexto
Enable support = Habiliar suporte
Splash screen settings = Configurações da Splash Screen
Mouse Click to proceed = Clique do Mouse para proceder
Display during a number of seconds = Mostrar durante um numero de segundos

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = Esta opção irá encriptar seu aplicativo protegido. Você não deve desmarcar esta opção, a não ser em caso de debug.

Check this option only if your protected DLL will be used as plugin in third party software. = Marque esta opção apenas se sua DLL protegida for usada como plugin em software de terceiros.

You can change the name of the last section added by Themida = Você pode alterar o nome da ultima seção adicionado por Themida

This option should always be enabled to protect your .NET assemblies = Está opção devera estar sempre habilitada para proteger seus assemblies .net

Support for Active Context based DLLs = Suporte para DLLs baseadas em contexto ativo

Select a BMP-8 image that will be displayed when your application is launched = Selecione uma imagem BMP-8 que será mostrada quando seu aplicativo iniciar

The user must click in the Splash Screen to continue running the protected application = O usuario deverá clicar na Splash Screen para continuar rodando o aplicativo protegido

The splash screen will be displayed for a custom number of seconds before continue running the protected application = A splash Screen será mostrada por um determinado numero de segundos antes de continuar com a execução do aplicativo protegido

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = Esta opção irá habilitar proteção para teste e licenciamento em Ring-0, que irá melhorar a maneira em que as informações de teste serão armazenadas no sistema. Se você marcar esta opção, um driver será anexado e extraido automaticamente quando sua aplicação iniciar. Note que o ID do Hardware é diferente se você ativar ou desativar esta opção


Reading SDK Macros = Lendo Macros SDK
Redirecting and Encrypting SDK Macros = Redirecionando e Encriptando Macros SDK
Merging sections / Preparing PE Header = Juntando as seções / Preparando cabeçalho PE
Examining and Wrapping API Calls = Examinar e Encapsular as chamadas de API
Generating Unique SecureEngine Code = Gerando Codigo SecureEngine unico
Linking SecureEngine Code with Application = Lincando Codigo secureEngine com a aplicação
Generating Unique Virtual Machine = Gerando Maquina Virtual Unica
Compressing Virtual Machine = Comprimindo Maquina Virtual
Virtualizing VM / CodeReplace Macros = Virtualizando MV / Macros CodeReplace
Compressing Application and Resources = Comprimindo aplicação e recursos
Encrypting Application and Resources = Encriptando Aplicação e recursos

Test Protected File = Testar arquivos protegidos
Protect = Proteger
Cancel = Cancelar
Play sound when protection finishes = Tocar um som quando a terminar a proteção

This option supervises at any time if your application is running under any kind of debugger. = Esta opção supervisiona a qualquer momento se sua aplicação está rodando sobre qualquer tipo de debugger.
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = Esta opção inpede sua aplicação de ser despejada da memoria para o disco mesmo utilizando a ferramenta mais avançada de liberação de memoria.
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = Esta opção remove e encripta os pontos de entrada de sua aplicação, executando-os de um lugar seguro na memoria
This option will keep your application resources fully encrypted against modifications = Esta opção ira manter sua aplicação totalmente encriptada contra modificações
If you want that your application will run inside VMWare/VirtualPC you must check this option = Se você quiser que sua aplicação rode dentro do VMWare/VirtualPc você precisa marcar esta opcao
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = Esta opção ira encapsular as APIs usadas no seu aplicativo para impedir reconstrução do aplicativo original
This option detects if any modification is done to your protected application, either by a cracker or a virus = Esta opção detecta se qualquer modificação foi feita em seu aplicativo, mesmo por um crack ou um virus
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = Esta opção irá ativar a ferramenta de metamorfose interna para gerar multiplos codigos de operação mutavel para um unico bloco de codigo
This option will protect your application against memory patching = Esta opcao irá proteger seu aplicativo contra alterações na memoria
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = Esta opção permite que você escolha a opção desejada para executar quando uma ferramente de debbuger ou cracking for encontrada na memoria
This option keeps your application code compressed meanwhile it is not executed = Esta opcao mantem o codigo de seu aplicativo comprimido mesmo quando ele não está em execução
This option keeps the resources in your application fully compressed = Esta opção mantem os recursos de seu aplicativo totalmente comprimidos
This option will compress the SecureEngine code that is appended into your protected application = Esta opção ira comprimir o codigo de SecureEngine que é anexado ao seu aplicativo protegido
This option will detect/fool possible files monitors when your protected application is running = Esta opção irá detectar possiveis monitores de arquivos quando sua aplicação estiver rodando
This option will detect/fool possible registry monitors when your protected application is running = Esta opção irá detectar possiveis monitores de registros quando sua aplicação estiver rodando
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Esta opção irá proteger seu formulário Delphi/BCB de ser reconstruido em memoria. Note que esta opção é incompativel com algumas aplicações Delphi/BCB
Load your customized messages from a file = Carregar suas mensagens personalizadas de um arquivo
Save your customized messages to a file = Salvar suas mensagens personalizadas em um arquivo
This list displays all the DLLs imported by your application = Esta lista mostra todas as DLL importadas pelo seu aplicativo
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = Esta lista mostra todas as funções importadas para a DLL selecionada. Você pode selecionar qual função será "Virtualizada"
You can import API names from a text file. The imported APIs will be virtualized in the current project = Você pode importar nomes de APIs de um arquivo. As APIs importantes serão virtualizadas neste projeto
Select the maximun number of instructions to virtualize from your application entry point = Selecione o numero máximo de nomes de APIs para virtualizar do ponto de entrada de sua aplicação
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = Esta opção irá inserir multiplas funções de sauto condicional dentro de sua unica maquina virtual, tornando mais dificil para analisar
You can save the current selected APIs into a text file to be imported by another project = Você pode salvar as APIs selecionadas em um arquivo texto para serem importadas por um outro projeto
Complexity level to emulate each wrapped API = Level de comprexidade para emular cada encapsulamento de API

Changes have been made. Do you want to save project? = Foram feitas algumas alterações, Você deseja salvar seu projeto?
Save Changes = Salvar Alterações

*UNSAVED* = *Não Salvo*
Invalid Project File. Please, recreate a new one = Arquivo de projeto inválido. Por Favor, crie um novo.
Load Project = Carregar Projeto
You need XBundler .NET for your .NET application. Please contact info@oreans.com = Você precisa do XBundler .NET para sua aplicação .NET. Por favor contate info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = Desculpa, Themida Standard não pode proteger arquivos .NET. Você precisa atualizar para Themida profissional para ter suporte a .NET. Atualizar agora?
Save Project = Salvar Projeto
Save Project As... = Salvar Projeto Como...
No file selected. Please select a file to protect (Input Filename) =  Nenhum arquivo selecionado. Por favor selecione um arquivo para proteger (Nome de arquivo de entrada)
No Output file selected. Please select an Output file before protecting = Nenhum arquivo de saida selecionado. Por favor seleciona um arquivo de saida antes de proteger
File does not exists: = Arquivo não existe:
File is already protected/compressed: = Arquivo já protegido/comprimido:
File has invalid macros insertion: = Arquivo tem algumas inserções de macros inválidas:
Please, review your macros again = Por favor, reveja suas macros novamente
File cannot be accessed for protection: = Arquivo não pode ser acessado para proteção:
Please select a new file to protect (Input Filename) = Por favor selecione um novo arquivo para proteção (nome do arquivo de entrada)
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Arquivo ainda não foi simulado. Por favor simule o arquivo antes de proteger ou desmarque a caixa de seleção "Force a simulação antes de proteger"
Open Input File = Abrir arquivo de entrada
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = A seção de recursos de seu aplicativo está vazia. Themida precisa reconstruir o cabeçalho de sua aplicação. Proceder?
Rebuild Header = Reconstruir Cabeçalho
File is compressed or already protected: = Arquivo está comprimido ou já está protegido:
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = Sua aplicação parece estar em uso ou rodando na memoria. Por favor, feche-a antes de continuar
Error = Erro
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = O cabeçalho de sua aplicação é imcompativel com o Themida. Você deseja que Themida reconstrua o cabeçalho de sua aplicação?
.NET limitation = Limitações .NET
Sorry, you cannot change the global message caption in demo version = Desculpe, você não pode mudar as mensagens globais na versão demo
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = Aviso! As macros de CodeReplace correntes não validas para o arquivo selecionado. Macros de CodeReplace removidas
Warning = Aviso
Warning! The current application is already protected/compressed. Do you still want to protect it? = Aviso! A aplicação corrente já está protegida/comprimida. Você ainda quer proteje-la?
File has a missing macro START or END: = Está faltando uma macro START ou ENd no arquivo:
Please review your macros again = Por favor reveja suas macros novamente
File cannot be opened: = Arquivo não pode ser aberto:
Make sure that other application is not using it = Tenha certeza que nenhum outro aplicativo está usando isso
File to protect has an invalid PE header. Unable to inspect file = O arquivo para proteger tem um cabeçalho PE inválido. Não foi possivel inspecionar o arquivo
File to protect contains one macro with few lines of code on it. Please review your macros again = O arquivo para proteger tem uma macro com algumas linhas de codigo. Por favor reveja suas macroas novamente
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Desculpe, esta versão do Themida não suporta CodeReplace em aplicações Visual Basic Pcode
Sorry, the current version of Themida does not support CodeReplace in .NET applications = Desculpe, esta versão do Themida não suporta CodeReplace em aplicativos .NET
Unable to find a function to add CodeReplace technology = Não foi possivel encontrar uma função para adicionar a tecnologia CodeReplace
Run with parameters = Executar com parametros
Please enter the parameters = Por favor entre com os parametros
Sorry, you cant disable that option in demo version = Desculpe, você não pode disabilitar essa opção na versão demo
Messages exported to = Mensagens exportadas para
Messages imported from = Mensagens importadas de
Themida GUI Overview = Visão geral da Themida GUi
Protect Now = Proteger Agora
SecureEngine Technology = Tecnologia SecureEngine
SecureEngine Macros = Macros SecureEngine
Code Replace = Substituir Codigo
Software Updates = Atualizações de Software
What is XBundler = Oque é XBundler
Using XBundler = Usando XBundler

Scenarios for Using XBundler = Cenarios para usar XBundler
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = *** Erro: Arquivo do projeto não existe ou é invalido. (Codigo de saida 1) ***
*** ERROR: File to protect does not exist. (Exit code 2) *** = ***Erro: Arquivo para proteger não existe. (Codigo se saida 2) ***
*** ERROR: File is already protected. (Exit code 3) *** = ***Erro: Arquivo já está protegido (Codigo de saida 3) ***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** ERRO: Erro nas macras de SecureEngine. Por favor reveja-as novamente. (Codigo de saida 4) ***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = *** ERRO: Arquivo para proteger não pose ser aberto. (Codigo de saida 2) ***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** ERRO: O Arquivo para Splash Screen não parece ter 256 cores. Apenas bitmap de 256 cores serão mostrados corretamente.
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = *** ERRO: O arquivo para Splash Screen parece estar comprimido. Apenas bitmap não comprimidos serão mostrados corretamente.
Macros found: = Macros encontradas:
*** Fatal error while protecting file. (Exit Code 5) *** = *** Erro Fatal enquanto protegia o arquivo. (Codigo de saida 5) ***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = *** Erro: Não foi possivel escrever o arquivo protegido. Tenha certeza que o arquivo não está em uso. (Codigo de saida 6) *** 
Generating Unique SecureEngine Code... = Gerando codigo unico de SecureEngine...
Linking SecureEngine Code with Application... = Lincando o codigo de SecureEngine a aplicação...
done. = concluido.
Encrypting Application and Resources... = Encripitando aplicação e recursos...
Compressing Application and Resources... = Comprimindo aplicação e recursos...
Macros processed: = Macros processadas:

processed: Processado:
Application successfully protected. = Aplicação protegida com sucesso.
Do you want to go to the order form Themida subscription plans? = Você gostaria de ir para o formulario de planos de assinatura Themida?
No file selected. Please, select a file to protect (Input Filename) = Nenhum arquivo selecionado. Por favor, selecione um arquivo para proteger (Nome do arquivo de entrada)
Question = Perguntas
-- Files to Bundle -- = -- Arquivos para Empacotar --
The path of the file that you are inserting must be relative to: = O caminho do arquivo que você está inserindo deve ser ralativo a:
All imported by ordinal! = Todas importações por ordinal!
Medium = Medio
Normal = Normal
High = Alta
Supreme = Suprema
Extreme = Extrema
Highest = Mais Alta

This option is not enabled in DEMO version = Esta opção não é habilitada na versão de demostração
DEMO Restriction = Restrições de Demostração
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = O Arquivo para Splash Screen não parece ter 256 cores. Apenas bitmap de 256 cores serão mostrados corretamente.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = O arquivo para Splash Screen parece estar comprimido. Apenas bitmap não comprimidos serão mostrados corretamente.
Sorry, Themida DEMO does not support RISC-128 processors = Desculpe, Themida DEMO não suporta processadores RISC-128
Processor Type = Tipo do Processador
Sorry, Themida DEMO does not support Dynamic Opcodes = Desculpe, Themida DEMO não suporta Codigos Operacionais dinamicos
The file is never extracted to disk! = O arquivo nunca é extraido para o disco!
Select file/s to bundle = Selecione o(s) arquivo(s) para encapsular
No file selected. Please, select a file to protect (Input Filename) = Nenhum arquivo selecionado. Por Favor, selecione um arquivo para proteger (nome do arquivo de entrada)
Last Modified: = Ultima modificação
(Application header has been rebuilt by Themida) = (O cabeçalho da aplicação foi reconstruido pelo Themida)
File Type: Windows Standard Executable = Tipo de Arquivo: Executavel padrão Windows
File Type: Visual Basic Native Executable = Tipo de Arquivo: Executavel nativo Visual Basic
File Type: Visual Basic PCode Executable = Tipo de Arquivo: Executavel Pcode Visual Basic
File Type: Windows .NET Executable = Tipo de Arquivo: Executavel .NET Windows
File Type: MACROMEDIA Executable = Tipo de Arquivo: Executavel MACROMEDIA
File Type: PowerBuilder Application = Tipo de Arquivo: Aplicação PowerBuilder
File Type: Excelsior JET Application = Tipo de Arquivo: Aplicação Excelsior JET
File Type: Dynamic Link Library (DLL) = Tipo de Arquivo: Dynamic Link Library (DLL)
File Type: OLE Control Extension (OCX) File = Tipo de Arquivo: Arquivo de Extensao OLE Control (OCX)
File Type: Screensaver File = Tipo de Arquivo: Arquivo de proteção de tela
File Type: Windows NT Service = Tipo de Arquivo: Serviço Windows NT
File Type: Borland Library = Tipo de Arquivo: Biblioteca Borland
File Type: Linux Executable (ELF/i386) = Tipo de Arquivo: Executavel Linux (ELF/i386)
File Type: NT Device Driver = Tipo de Arquivo: Driver de dispositivo NT

*** Protected with Code Virtualizer *** =  *** Proteger com virtualização de codigo ***
Virtual Machine Macro Functions: = Macro Funções da maquina virtual:
CodeReplace Macro Functions: = Macro Funções de CodeReplace:
CodeEncrypt Macro Functions: = Macro Funções de CodeEncrypt:
ClearCode Macro Functions: = Macro funções de ClearCode:
Registered Macro Functions: = MAcro funções registradas:
Unregistered Macro Functions: = Macro funções não registradas:
Read functions automatically = Ler funções automaticametente
Read functions from SDK = Ler funções do SDK
File already protected/compressed. = Arquivo já progedo/comprimido.
Error: There is a missing START or END in one of your macros. = Erro: Está faltando um START ou END um uma de suas macros.
Error: Unable to open the selected file. File may be in use. = Erro: Não foi possivel abrir o arquivo selecionado. Arquivo pode estar em uso.
Error: Invalid PE header in selected file. = Erro: cabeçalho PE invalido no arquivo selecionado.
Error: The included code inside a macro is too small. = Erro: O codigo incluido dentro da macro é muito pequeno.
Error: There are at least a nested VM macros. VM macros cannot be nested. = Erro: Existe pelo menos uma Macro de MV aninhada
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = Erro: O arquivo selecionado não é um aplicativo x64. Você precisa do Themida x32 para proteger esse aplicativo.
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = Erro: O arquivo selecionado é um aplicativo x64. Você precisa do Themida x64 para proteger esse aplicativo.
Project: = Projeto:
Select functions from MAP file = Selecione as funções do arquivo MAP
Read functions automatically = Ler funções automaticamente
How many functions do you want to add? = Quantas funções você deseja adicionar?
OK = OK
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = Desculpe, o arquivo MAP requerido não foi encontrado. Por favor, crie um arquivo MAP para seu aplicativo
There are not functions to simulate. Please, insert some functions either manually or automatically = Não existe funções para simular. Por favor, insira algumas funções tanto manualmente quanto automaticamente.
Simulator = Simulador
Information = Informações
None = Nenhum
Message = Mensagem
Customize Dialog = Dialog Personalizado 
Close = Fechar

Internal Protection Messages = Mensagens internas de proteção
Trial/Registration Messages = Mensagens Trial/Registro
Will be displayed by WinLicense = Será mostrado por WinLicense
Displayed by SDK or not displayed = Mostrado pelo SDK ou não mostrado
Cannot update oreans.sys driver (admin rights) = Não é possivel atualizar o driver oreans.sys (direitos de administrator)
Cannot open oreans.vxd driver (already in use) = Não é possivel abrir o driver oreans.sys (já em uso)
Driver cannot be updated = Driver não pode ser atualizado
Computer needs to be reset to install driver = o computador precisa ser inicializado para instalar os drivers
Cannot write oreans.vxd (already in use) = Não é possivel escrever em oreans.xvd (já em uso)

Trial nag screen (reminder) = Tela persistente de Trial (Lembrete)
Trial days expired = Dias de teste expirados
Trial executions expired = Execuções de teste expiradas
Trial date expired = Data de testes expirou
Trial runtime expired = Tempo de execução de teste expirou
Trial global time expired = Tempo global de teste expirou
Trial locked to different country = Teste bloqueado para um país diferente
Trial extension key corrupted = Extensão da chave de teste corrompida
No more trial extensions allowed = Não é mais permitido extensões de teste
Show registration info (only first time when registered) = Mostrar informações de registro (apenas na primeira vez quando registrado)
License days expired = Dias de licença expirados
License executions expired = Execuções da licença expirados
License date expired = Data da licença expirada
License global time expired = Tempo global da licença expirado
License key corrupted = Chave da licença corrompida
License locked to different machine = Licença bloqueada para uma maquina diferente
License without machine locking = Lecença sem trava de maquina
No more hardware changes allowed = Mais nenhuma mudança no hardware é permitida
Stolen license key = Chave de licença roubada
License is not expirable = Licença não expira
License required to run = Licença obrigatória para rodar
Trial/Licensing Manager manipulated = Gerenciador de Trial/Licenças manipulado
Invalid user/password (for password dialog) = Senha/Usuário inválido (para dialog de senha)

This application(s) will run in trial/restricted mode, until registered. = Este aplicativo irá rodar em modo teste/restrito, até ser registrado.
Days Expiration = Dias de expiração
Date Expiration = Data de expiração
Executions = Execuções
Run Time (execution) = Tempo de execução (execuções) 
Global Time = Tempo Global
days = dias
times = horas
minutes = minutos
Unlimited = ilimitado
(For custom restrictions) = (para restrições personalizadas)
Trial Restrictions = Restrições de teste
Clock Change = Relogio alterado
Trial Extension = extensões Trial
Lock trial to user language = Travar trial para a lingua do usuário
Allow trial period to be extended (with a valid key) = Permite o tempo de teste ser extendido (com uma chave valida)
Extension Key distribution options = Opções de distribuição de Chaves de extensão
With single file = Com arquivo simples
With Registry = Com registro
Value Name = Nome do valor
Maximum Extensions = Extensões maximas
Maximum extensions allowed = Extensões maximas permitidas


This option sets a trial period to a certain amount of days since the application is started for the first time = Esta opção define um periodo de teste para uma certa quantidade de dias desde a primeira execução do programa
This option sets an exact date for the end of the trial period = Está opção define uma data exata para um fim do periodo de teste
This option sets an exact number of executions allowed for an application = Esta opção define um numero de execuções exatos permitido para o aplicativo
This option sets an exact amount of time (in minutes) that an application can stay in memory = Esta opção define um tempo (em minutos) exatos que o aplicativo pode permanecer na memoria
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Esta opção define um tempo total (em minutos) exatos que o aplicativo pode rodar em todas as sessoes Windows®
This option allows an application to run in trial mode without any restrictions added by WinLicense = Esta opção permite uma aplicação rodar sem nenhuma restrição adicionada por uma WinLicense
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = Você pode selecionar o quão sensivel a WinLicense ira lidar contra alterações de relogia. Se por exemplo, você selecionar "1 dia atrasado", WinLicense irá ignorar se o relógio retornar 1 dia.
This option allows an application to be locked to specific country when it runs in trial mode = Esta opção permite uma aplicação se travada para um país especifico quando rodada em modo teste
This option allows you to extend the trial period of your application with special trial extension keys = Esta opção permite você expandir o tempo de teste de sua aplicação com uma extensão de chave de teste especial
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = Esta opção define o nome de um arquivo de extensão de teste para ser procurado pela WinLicense quando o aplicativo está sendo inicializado
This option is used to allow distribution of extension keys as Windows® Registry key files = Esta opção é usada para permitir a distribuição de chaves de extensão como arquivos chaves do registro do Windows®
This option limits the amount of trial extensions that an application can be extended = Esta opção limita a quantidade de extensões de teste que o aplicatibo pode ser extendido

Any clock change = Qualquer alteração do relógio
1 hour clock back = 1 hora atrasado
1 day clock back = 1 dia atrasado

This application(s) can be registered, with the presence of a valid key. = Esta aplicação pode ser registrada, com a presença de uma chave valida.
License Keys Accepted = Chave de licença aceita
Types of accepted License Keys = Tipos de chaves de licença aceitas
Single file = Arquivo simples
Registry = Registro
Security Options = Opções de segurança
Enable SmartActivate® System for user-side generated keys. = Habilitar sistema SmartActivate® para chave gerada no lado usuario
Allow only hardware dependent (locked) registrations. = Permite apenas registros dependentes(travado) do hardware.
Accept only temporary keys (that expire). = Aceita apenas chaves temporarias (que expiram).
Application only runs when registered. (Requires a key to run) = Aplicativo apenas roda registrado. (Precisa de uma chave para rodar)
Clear trial info when registered. = Limpar informações de teste quando registrado.
License Key Signature = Assinatura da chave de licença
Level 1 = Nivel 1
Level 2 = Nivel 2
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = Para um controle profissional e elegante das licenças, WinLicense oferece o sistema SmartActivate®. Esta tecnologia permite uma aplicação ser registrada usando chaves SmartActivate® 
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = Esta opção restringe o uso de chaves de restrição para um computador especifico. Como cada computador tem um ID unico (Tipo de processador, HD e serial da BIOS), WinLicense pode travar uma chave de registro para esta maquina especifica
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = Esta opção proibe o uso de chaves de registro "Tempo ilimitado" e força o WinLicense a aceitar apenas chaves de registro temporario
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = Esta opção permite usuarios a rodar uma aplicação apenas na presença de uma chave de registro valida. WinLicense ira finalizar a aplicação se uma chave não for encontrada ou não for válida
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = O motivo desta opção é limpar as informações de teste de um computador quando um usuario receber uma chave de registro valida e registrar a aplicação. Se o usuario decidir remover a chave de registro ou ela expirar, o periodo de teste irá reiniciar do zero
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = Esta opção permite você selecionar o nivel de assinatura usado pelo WinLicense para checar que esta licença para seu aplicativo é genuina

Enable Password Protection = Habilitar proteção por senha
Password requirement = Senha obrigatória
Password Action = Ação da senha
Encrypt EXE using the password hash. = Encriptar EXE usando a senha hash.
On Normal / Trial Version = Na versão Normal/Trial
On Registered Version = Na vesão registrada
Never ask for a password. = Nunca solicitar senha.
I will ask for a password manually. = Eu irei solicitar uma senha manualmente.
Automatically, ask for a password only the first time. = Automaticamente, solicitar senha apenas na primeira execução.
Automatically, always ask for a password. = Automaticamente, sempre solicitar uma senha.

Hardware Lock = Trava de hardware
Custom Hardware Items = Itens de hardware personalizados
Hardware Items = Itens de hardware
All hardware items = Todos os itens de hardware
CPU = CPU
BIOS =  BIOS
MAC Address = MAC Address
HDD Serial = Serial HDD
Allowed CPU changes = Alteração da CPU permitida
Allowed BIOS changes = Alteração da BIOS permitida
Allowed NIC changes = Alteração do NIC permitida
Splash settings = Tela de Configurações

Keep Trial Running = Manter teste rodando
Keep running = Manter rodando
Launch Application when Trial Expired = Executar aplicação quando o trial expirar
Launch Application = Executar aplicação
Application Name: = Nome da aplicação:
Enable Custom Event = Habilitar Eventos personalizados
Export Specific Generators = Exportar Geradores especificos
Event Name: = Nome do evento:
Export Generators = Exportar geradores
Custom Event = Evento personalizado
This option will export a specific license generator when your application is being protected = Esta opção irá exportar um gerador de licença especifico quando sua aplicação estiver sendo protegida
This option will run an external application when the trial period in your application has expired. = Esta opção irá rodar uma aplicação externa quando o periodo de testes em sua aplicação expirar
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. = Você pode definer um evento personalizado para excluir a inicialização de diversos aplicativos protegidos ao mesmo tempo. Esta opção é também apropriada quando sua aplicação é executada muitas vezes por minuto.
Check this option if you want that your application continues running in trial mode if an invalid license key is present. = Marque esta opção se você quer que sua aplicação continue rodando em modo de teste se uma chave invalida esta presente.
*** Demo Version *** = *** VERSÃO DEMO ***
Destroy Exports section = Destruir seções exportadas
This option will destroy the export table of your DLL control for maximum security = Esta opção irá destruir a tabela de exportação de seus controles DLLs para maxima segurança
Select specific functions from your DLL to handle each event = Selecione a função especifica de sua DLL para manipular cada evento
DLL Control file = Arquivo de Controle DLL

Export specific generators to App. folder = Exportar geradores especificos para a pasta da aplicação
Trial in debug mode (for testing purposes) = Trial em modo Debug (para teste)
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = Marque esta opção se você quer criar um gerador de licença personalizado para proteger sua aplicação. O gerador irá ser criado em uma subpasta dentro da pasta de sua aplicação.
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = 
Desmarque esta opação apenas quando você for liberar seu programa protegido. Para propositos de teste, deixe esta opção marcada para impedir armazenamento inecessario de informação em seu sistema sobre o status de seu teste.

&Add = Adicionar
&Edit = Editar
&Delete = Excluir
Name = Nome
Company = Compania
Total Customers: =  Clientes totais:
New Customer = Novo Cliente
Edit Customer = Editar Cliente
Delete Customer = Excluir Cliente
Customers = Clientes
Extra Details = Detalhes extra
Add Customer = Adicionar Cliente
Update = Atualizar
Filename = Nome do Arquivo
Version = Versão
Total Software: = Software Total:
Do you want to delete this software? = Você deseja excluir este software?
Confirm = Confirmar
Add Software = Adicionar Software
Edit Software = Editar Software
Delete Software = Excluir Software
Duplicate Software = Duplicar Software
(leave blank to use the same input and output filename) = (deixe em brando para usar o mesmo nome de arquivo para entrada e saida)
Input File Type = Tipo de arquivo de entrada
License Unique Key = Chave Unica de Licença
Trial Unique Key =  Chave Unica de Trial
Password Unique Key =  Chave Unica de Senha
Windows Standard Executable (EXE) = Executavel Padrão Windows (EXE)
Dynamic Link Library (DLL) = Dynamic Link Library (DLL)
OLE Control Extension (OCX) = extensão OLE Control (OCX)
Windows .NET Executable = Executavel Windows .NET
Windows NT/XP Service = Serviço Windows NT/XP
Screensaver File (SCR) = Arquivo de Proteção de TEla (SCR)
Copy Software = Copíar Software
Reg Unique Key missing. Please, select one. = Faltando chave unica de registro. Por favor, selecione uma.
Software Manager = Gerente de Software
Sofware name missing. Please, select one. = Faltando nome do software. Por favor, selecione um.
Reg Unique Key is too short. Please, select a new unique key. = Chave unica de registro é muito pequena, Por favor, selecione uma nova chave unica.
Trial Unique Key missing. Please, select one. = Faltando chave unica de Trial. Por favor, selecione uma.
Trial Unique Key is too short. Please, select a new unique key. = Chave de Trial é muito pequena. Por favor, seleciona uma nova chave unica.
Pass Unique Key missing. Please, select one. = Faltando chave unica de senha. Por favor, selecione uma.
Pass Unique Key is too short. Please, select a new unique key. = Chave unica de senha é muito pequena. Por favor, selecione uma nova chave unica.
The software already exists in database. Please, choose a new software name or version. = O software já existe da base de dados. Por favor, selecione um novo software ou versão.
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = Uma nova licença Hash está prestes a ser criada. A licença gerada anteriormente não ira mais funcionar se você criar um novo hash. Continuar?
Duplicated Software = Software duplicado
File cannot be opened. Make sure the application is not running or being used. = O aquivo não pode ser aberto. Tenha certeza que o aplicativo não está em execução ou sendo usado.
Protection Error = Erro de Proteção
Protect Error = Proteger Erro
File is compressed or already protected. = O arquivo está comprimido ou já é está protegido.
File has a missing macro START or END. Please correct this error before protecting. = Está faltando uma Macro START ou END no arquivo. Por favor corrija esse erro antes de proteger.
File cannot be opened. Make sure that other application is not using it. = O arquivo não pode ser aberto. Tenha certeza que outra aplicação não esta usando-o.
File has an invalid PE header. Unable to protect. = O Arquivo tem um cabeçalho PE invalido. Não foi possivel proteger.
File contains one macro with few lines of code on it. Please review your macros before protecting. = O arquivo contem uma macro com algumas linhas de codigo. Por favor reveja suas macros antes de proteger.
File seems to be in use. Please, close the file to proceed with protection. = Parece que o arquivo está em uso. Por favor, fecho o arquivo para proceder com a proteção.
The splash file does not exist. = O arquivo para splash screen não existe.
Splash = Splash
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = O Arquivo para Splash Screen não parece ter 256 cores. Apenas bitmap de 256 cores serão mostrados corretamente.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = O arquivo para Splash Screen parece estar comprimido. Apenas bitmap não comprimidos serão mostrados corretamente.
Do you want to cancel the protection process? = Você deseja cancelar o processo de proteção.
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = Não é possivel abrir o arquivo para proteger de escrita. Por favor, tenha certeza que o arquivo não está sendo usado ou em execução. Proteção abortada.
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = Não é possivel escrever o arquivo protegido no disco. Por favor, tenha certeza que você tem permissão de escrita e espaço suficiente em seu disco.
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = Desculpe, a versão DEMO de WinLicense apenas permite proteção com Trial/Licença em modo de debug
WinLicense DEMO = WinLicense DEMO

&Add License = Adicionar Licença
&Edit License = Editar Licença
&Delete License = Excluir Licença
Create License Key = Criar chave de Licença
Mark as Stolen = Marcar como Roubada
Unmark Stolen = Desmarcar roubo
Stolen = Roubada
Ban Hardware IDs = Ids de hardware banidos
Please make a selection... = Por favor, faça uma seleção...
License Details = Detalhes da licença
License Generation = Geração de Licença
Hardware ID = ID do HardWare
Custom Data = Data personalizada
Key Type = Tipo da Chave
Country Locking = Trava de País
Store generated Licenses in folder: = Armazenar chave gerada na pasta:
Generate File Key = Gerar Arquivo Chave
Generate Registry Key = Gerar Chave de Registro
Generate Text Key = Gerar Chave Texto
Generate SmartActivate Key = Gerar Chave SmartActivate

Total Software: = SoftWare total:
All = Todos
Please make a selection... = Por favor, faça uma seleção...
Nothing selected. = Nada selecionado.
Selection: = Seleção:
Software: = Software:
Do you want to mark the current key as stolen? = Você deseja marcar a chave corrente como roubada?
Stolen Keys = Chaves roubadas
Do you want to unmark the current key from being stolen? = Você deseja desmarcar a chave corrente como roubada?
Do you want to delete this license? = Você deseja excluir essa licensa?
Warning: The generated keys will have the settings from the current project. Proceed? = Aviso: As chaves geradas terão os ajustes do projeto atual. Continuar?
Generate License = Gerar Licenças
Cannot create directory: = Não é possivel criar o diretorio
Please, select which type of license you want to generate = Por favor, selecione qual tipo de licença você deseja gerar 
Keys successfully generated in folder: = Chaves geradas com sucesso na pasta:
Please, first select a valid application to protect = Por favor, selecione primeiro uma aplicação válida para proteger
Ban Hardware Id = Id de hardware banido

License Restrictions = Restrições da Licença
Customer = Clientes
Software = Software
Save = Salvar
Edit License = Editar Licença
Add License = Adicionar licença
Please, select a customer from database. = Por favor, selecione um cliente da base de dados.
License Manager = Gerenciador de licenças
Please, select a software from database. = Por favor, selecione um software da base de dados.
Please, insert a Hardware ID for verification = Por favor, insira um ID de hardware para verificação
The inserted Hardware ID is valid = O ID de hardware inserido é válido
Invalid Hardware ID inserted = ID de hardware inserido é inválido
Another instance of WinLicense is running = Uma outra instancia do WinLicense está rodando
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = Você habilitou as chaves SmartActivate mas você não selecionou nenhum tipo de chave de licença aceitos (arquivo simples ou registro) Lembre-se que você tem que usar WLRegSmartKeyInstallToFile ou WLRegSmartKeyInstallToRegistry para poder instalar a chave SmartActivate
File has not being simulated: = O arquivo não foi simulado:
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Por favor simule o arquivo antes de proteger ou desmarque o campo de marcação "Forçar simulação antes de proteger"
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = Aviso: sua aplicação foi definida para ser registrada com uma chave de licença válida, mas você não selecionou nenhuma forma de registro. Se você continuar, sua aplicação não sera capaz de ser registrada. Continuar?
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = Aviso: Sua aplicação foi definida para ser extendida com uma chave de extensão de teste, mas você não selecionou nenhuma maneira para extender o periodo de testes. Se você continuar, sua aplicação não será capaz de ser extendida. Continuar?
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = O cabeçalho de sua aplicação é incompativel com o WinLicense. Você deseja que o WinLicense reconstrua o cabeçalho de sua aplicação?
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = Desculpe, o WinLicense padrão não pode proteger arquivos .NET. Você precisa atualizar para WinLicense Profissional para suporte .NET. Atualizar agora?
Note: CodeReplace has been added into your application = Nota: CodeReplace foi adicionado em sua aplicação
(Application header has been rebuilt by WinLicense) = (O cabeçalho da aplicação foi reconstruido  por WinLicense)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = Erro: O arquivo selecionado não é um aplicativo x64. Você precisa do WinLicense x32 para proteger esse aplicativo
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = Erro: O arquivo selecionado é um aplicativo x64. Você precisa do  WinLicense x64 Edition para proteger essa aplicação
Sorry, the MAP file was not found: = Desculpe, o arquivo MAP não foi encontrado:
Please, generate a MAP file for your application = Por favor, gere um arquivo MAP para sua aplicação
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Desculpe, a versão atual do WinLicense não suporta CodeReplace nas aplicações Visual Basic Pcode 
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = Desculpe, a versão atual do WinLicense não suporta CodeReplace nas aplicações .NET
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = Existe algumas funções muito executadas e algumas não executadas na simulação. Você deseja deselecionar estas funções?
There are some functions highly executed in simulation. Do you want to unselect those functions? = Existe algumas funções muito executadas na simulação. Você deseja deselecionar estas funções?
There are some functions not executed in simulation. Do you want to unselect those functions? = Existe algumas funções não executadas na simulação. Você deseja deselecionar estas funções?
Messages exported to: = Mensagens exportadas para:
Messages imported from: = Mensagens importadas de:
WinLicense GUI Overview = Visão geral da GUI do WinLicense
Trial Settings = Ajustes do Trial
Trial SDK = SDK do Trial
Registration SDK = SDK Registro
Password Protection = Proteção de senha
Miscellaneous SDK = SDK Variado
Hardware Lock = Travar hardware
WARNING: Protected in Trial Debug Mode = Aviso: Protegido no mode Debug Trial
Click and select here = Clique e selecione aqui
ERROR: None of the functions handlers where specified in DLL Control = Erro: Nenhum dos manipuladores de funções foram especificados na DLL de controle
Sorry, WinLicense DEMO does not support RISC-128 processors = Desculpe, WinLicense DEMO não suporta processadores RISC-128
Sorry, WinLicense DEMO does not support Dynamic Opcodes = Desculpe, WinLicense DEMO não suporta codigos operacionais dinamicos
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = Assinatura nivel 2 não é aceita para o software atual. Por favor, vá até o painel de SoftWare e re-crie uma nova licença Hash para sua aplicação
.NET Module = Modulo .NET
File has a missing macro START or END. Please review your macros again: = Está faltando uma macro START ou END no arquivo. Por favor reveja suas macros novamente:
File cannot be opened. Make sure that other application is not using it: = Arquivo não pode ser aberto. Tenha certeza que outros aplicativos não estao usando-o:
File has an invalid PE header. Unable to inspect file: = O arquivo tem um cabeçalho PE inválido. Não foi possivel inspecionar o arquivo:
File contains one macro with few lines of code on it. Please review your macros again: = O arquivo contem uma macro com algumas linhas de codigo. Por favor reveja suas macros novamente:
Deep file analysis in progress = Analise profunda do arquivo em andamento
File analysis in progress = Analise de arquivo em andamento
Please wait... = Por favor aguarde...
Analyzing CodeReplace macros = Analisando macros CodeReplace
Are you sure you want to remove the selected Hardware ID? = Você tem certeza que deseja excluir o ID de hardware selecionado?
List of Banned  Hardware IDs: = Lista de IDs de hardware banidos:
Add = Adicionar
Remove = Remover
Done = Concluido
Generating License Hash = Gerando Licença HAsh
Generate Password = Gerar Senha
Password Generation = Geração de Senha
Store generated Passwords in folder: = Armazenar senhas geradas na pasta:
Total Passwords: = Senhas total:
Do you want to delete the selected record? = Você deseja excluir a informação selecionado?
Password file generated in folder: = Arquivo de senha gerado na pasta:
Password Generator = Gerador de Senha
Password Manager = Gerenciado de Senha
Details = Detalhes

Add Password = Adicionar Senha
Edit Password = Editar Senha
Please, select a customer to generate the password = Por favor, selecione um cliente para gerar um senha
Please, select a software to generate the password = Por favor, selecione um software para gerar uma senha
Rolling back your actions = Voltar suas ações

Generate Extension = Gerar extensões
Level = Nivel
Trial Extension Generation = Geração de extensão de Teste
Store generated Extensions in folder: = Armazenar extensões geradas na pasta:
Generate File Key = Gerar chave de arquivo
Generate Registry Key = Gerar chave de registro
Trial extension key/s generated in folder: = Chave(s) de extensão Trial geradasa na pasta:
Trial Extension Generator = Gerador de Extensão Trial
Edit = Editar
Add Trial Extension = Adicionar Extensão Trial
Edit Trial Extension = Editar Extensão Trial
Please, select a software to generate the trial extension = Por favor, selecione um software para gerar a extensão Trial

Warning: Trial in Debug Mode = Aviso: Trial em modo Debug
Debug Mode Trial = Modo Debug Trial
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = A aplicação que você está prestes a proteger não irá incluir o Trial do gerenciado de armazenamento SecureEngine*.
The trial information will be stored under the registry key: = A informação de teste será armazenada sobe a chave registro:
(You can access to that key to reset/test the WinLicense Trial Engine) = (Você pode acessar esta chave para reiniciar/testar o Trial do WinLicense Engine)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = *Para habilitar o Trial de gerenciado de armazenamento SecureEngine, desmarque a opção "Trial em Modo Debug" na tela de proteção.
Don't show this screen again = Não mostrar essa tela novamente

Do you want to delete the selected client? = Você deseja excluir o cliente selecionado?
Enter new Hardware ID to ban: = Entre com o novo ID de HardWare para banir:
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = O ID de Hardware fornecido não parece ser válido (deve ter pelo menos 32 caracteres) Por favor, entre com um ID de Hardware válido

File has a missing macro START or END. Please correct this error before protecting: = Esta faltando uma macro STAR ou END no arquivo. Por favor corrija este erro antes de proteger:
File has an invalid PE header. Unable to protect: = O arquivo tem um cabeçalho PE inválido. Não é possivel proteger:
File contains one macro with few lines of code on it. Please review your macros before protecting: = O arquivo contem uma macro com algumas linhas de codigo. Por favor reveja suas macros antes de proteger
The input file seems to be in use. Please, close the file to proceed with protection: = O arquivo de entrada parece estar em uso. Por favor, feche o programa para continuar com a proteção:

Code Virtualization = Virtualização de Codigo
Virtual Opcodes Obfuscation = Ofuscador de Codigo Operacional Virtual
Current: = Atual:
Virtual Machine Complexity = Complexidade da Maquina Virtual
Size (Approx): = Tamanho (aproximado)
Opcodes Mutation = Mutação de Codigo Operacional
Multiple Virtual Machines = Multiplas Maquinas Virtuais
NumVMs * SizeVM: = NumMVs * TamanhosMV
Fake Stack Emulation = Emulação Falsa da Pilha
Strip Relocations (EXEs) = Retirar Relocações (EXE)
Strip relocations = Retirar Relocações
Re-Virtualization = Re-Virtualização
Multi Branch Technology = Tecnologia Multi Branch
Fake Emulation = Emulação Falsa
Keep original name = Manter Nome Original
Functions that will be virtualized: = Funções que serão Virtualizadas

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = Você pode definir o quão complexo será os codigos operacionais da Maquina Virtual. O tamanho dos codigos operacionais gerados dependem da complexidade selecionada
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = Você pode definir o quão complexo a Maquina Virtual gerada será. O tamanho da Maquina Virtual depende da complexidade selecionada
You can mutate the internal virtual opcodes, generating a more complex virtual machine = Você pode mutar os codigos operacionais virtuais internos, gerando uma maquina virtual mais complexa
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = A maquina virtual e os codigos operacionais gerados serão incluidos dentro da proxima seção de seu aplicativo. Você pode renomear a ultima seção de seu aplicativo como desejado
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = Você pode criar varias maquinas virtuais dentro de sua aplicação protegida
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = Esta opção irá assumir que a pilha será inicializada do zero para toda entrada não alocada na pilha. Esta opção deve ser habilitada para aplicações PureBasic
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = Voçê pode remover as seções relocadas do cabeçalho PE para arquivos EXE, reduzindo o tamanho final da aplicação protegida
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Re-Virtualização é uma tecnica extremamente poderosa contra engenharia reversa. Mas isso pode decrementar muito a performance em velocidade dos blocos protegidos. Por favor, verifique a performance de sua aplicação quando protegida com Re-Virtualização
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = Esta opção irá inserir multiplas instruções de desvio condicional dentro de sua maquina virtual unica, tornando mais difícil para analise

Please, select an application to protect = Por favor, selecione uma aplicação para proteger
The selected application does not have any functions to virtualize. Please insert functions using the SDK = A aplicação selecionada não contem nenhuma função para virtualizar. Por favor insira funções usando o SDK
All functions to virtualize were disabled. Please, select at least one = Todas as funções para virtualizar estão disabilitadas. Por favor, selecione pelo menos uma
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = Aviso! Uma macro sem codigo foi encontrada. Isto pode ser devido a otimização do compilador. Por favor, disabilite a otimização de seu compilador ou reveja cada macro.
Virtual Functions = Funções Virtuais
Inserted via "Call VarPtr": = Inserido via "Call VarPtr":
Inserted via inline Assembly: = Inserido via inline Assembly:
Inserted via auxiliar API: = Inserido via API auxiliar:
Inserted via MAP file: = Inserido via arquivo MAP:
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = NENHUMA FUNÇÃO ENCONTRADA PARA VIRTUALIZAR!!!
(Application header has been rebuilt by Code Virtualizer) = (o Cabeçalho da aplicação foi reconstruido por Code Virtualizer)
Protecting an Application = Protegendo uma aplicação
Learn About Virtualizer = Aprender sobre Virtualização
Code Virtualization = Virtualização de Codigo
Code Virtualize Macros = Codificar Macros virtualizadas
**** Sorry, the DEMO version does not support protection via command line **** = **** Desculpe, a versão demo não suporta proteção via linha de comando ****
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** ERRO: Arquivo para proteger não pode ser acessado. (Codigo de saida 2) ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** ERRO: Arquivo não contem nenhum bloco para proteger. (Codigo de saida 3) ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** ERRO: Arquivo para proteger não pode ser aberto. (Codigo de saida 5) ***
Generating Specific Virtual Machine = Gerando Maquina Virtual Especifica
Virtualizing Function = Funções de Virtualização
Re-Virtualizing ... = Re-Virtualizando...
Flushing file ... = Liberando Arquivo
Sorry, the DEMO version only allows one Virtual Machine per application = Desculpe, a versão DEMO permite apenas uma maquina virtual por aplicação
Sorry, the DEMO version does not support Re-Virtualization = Desculpe, a versão DEMO não suporta Re-Virtualização
The application is already protected. You cannot protect an already protected application in the DEMO version = A plicação já está protegida. Você não pode proteger uma aplicação já protegida na versão DEMO
The Input application cannot be accessed. Please, check that the application is not in use: = O aplicativo de entrada não pode ser acessado. Por favor, verifique que o aplicativo não esteja em uso:
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = O aplicativo de saida não pode ser acessado. Por favor, verifique que o caminho da aplicação é válido ou que o arquivo não esteja em uso:
Limitations in DEMO version: = Limitações na Versão DEMO:
Virtual Opcodes Obfuscation set to NORMAL = Ofuscador de codigos operacionais definido como NORMAL
Virtual Machine Complexity set to NORMAL = Complexidade da maquina virtual definio como NORMAL
Only ONE macro is virtualized = Apenas uma macro está virtualizada
The Output application cannot be accessed. Please, check that the application is not in use: = O aplicativo de saida não pode ser acessado. Por favor, verifique se o aplicativo não está em uso:
PE Information = Informação PE
Input PE file: = Arquivo PE de Entrada
Output PE file: = Arquivo PE de Saida
Virtual Functions found: = Funções Virtuais encontradas:
PE file analysis... OK! = Análise do Arquivo PE... OK!
Virtualization = Virtualização
Generating Specific Virtual Machine = Gerando Maquina Virtual Especifica
Size: = Tamanho:
Virtualizing Function = Virtualizando Função
Start: = Iniciar:
Skipped = Saltado
bytes = bytes
Cancelling... = Cancelando...
Re-Virtualization = Re-Virtualização
Re-Virtualizing ... = Re-Virtualizando
Final Stats = Status Final
Virtualized Functions: = Funções Virtualizadas:
Skipped Functions: = Funções Saltadas:
Errors: = Erros:
Increase in size: = Incrementar em Tamanho:
Application successfully protected! = Aplicação protegida com sucesso!
Protection CANCELLED! = Proteção CANCELADA!
Do you really want to Cancel the protection process? = Você realmente quer cancelar o processo de proteção?
Cancel Protection = Cancelar Proteção
Select a Software to protect from the WinLicense database = Selecione um software para proteger da base de dados WinLicense


Anti-Debugger Detection = 
Advanced = 
Disable = 
Level 1 = 
Level 2 = 
File Patch (sign support) = 
Detect any change = 
Allow 1 hour back = 
Allow 1 day back = 
Allow clock changes = 
External Hardware = 
U3 USB device = 
(not Windows 9x/Me compatible) = 
Periodically check U3 device = 
The U3 USB device will be monitored to check if it's unplugged. The function WLHardwareRuntimeCheckU3 checks if the device is present or not at any time. = 
Checking U3 USB device = 
Network Instances: No more Allowed = 
Network Instances: Server not running = 
** Not available in current version ** = 
License installation time-limit exceeded = 
License disabled in current instance = 
Control Messages from external DLL = 
Select a DLL that will handle the displaying of each message. If no DLL is selected, Themida will display the above messages in a MessageBox =  
Functions Handlers = 
Select the function in your DLL that will handle the protection messages = 
Select the DLL that will handle all WinLicense events = 
Hide from PE scanners = 
Type 1 = 
Type 2 = 
Localization = 
Add Manifest = 
Don't add manifest = 
Add Custom manifest = 
MSVC80 manifest = 
XP Themes = 
MSVC90 manifest = 
Launch Application = 
This option will run an external application when the trial period in your application has expired. = 
Delete extracted on exit = 
Open Project = 
Description = 
Saved Projects = 
Date Created = 
Delete = 
Open = 
Reset Trial = 
Reset Trial in current machine = 
Search = 
Search Next = 
Install Before Date = 
Network Instances = 
Instances = 
Store Creation Date = 
Embed user info in key =  
(only for Dynamic SmartKeys) = 
Generate Dynamic SmartKey = 
Default License generation folder = 
License Restrictions = 
Miscellaneous = 
Search Details = 
Search by: = 
Search for: = 
Customer Name = 
GetPrivateProfile APIs support = 
